[
  {
    "SkinName":"Mbitjana / Mpetyane",
    "Language":"Anmatyerre",
    "Region":"Utopia, Central Australia",
    "Dreaming":"Bush Berry , Bush Plum, Awelye & Bush Melon",
    "DOB":"c.1945",
    "Biography":"Betty Mbitjana is the daughter of renowned artist Minne Pwerle and the sister of artist Barbara Weir. Her husband was Lena Pwerle's son, Paddy Club, who sadly passed away in 2012. \n  Betty paints the awelye, bush berry and bush plum dreaming. Her mother and other women used to collect these fruits, cut them up into pieces, skewer them on a piece of wood and dry them to be eaten in times when bush tucker was scarce. \n Betty's Awelye paintings depict the designs that the women would paint on their bodies, and the dancing tracks which are made in the sand during women's awelye ceremony. Through their awelye ceremonies, women pay homage to their ancestors, show respect for their country and dance out their collective maternal role within their community. \n A design based on these dancing tracks is painted on women's bodies before a ceremony is performed, and this same design can be seen today in Betty's works on canvas and in the works of her mother, sisters, and aunts. Ochre, charcoal and ash are all used to paint designs on the women's upper bodies, and Pwerle women paint their chests, breasts and upper arms for awelye in ochre, red and white. The designs they use have been passed down for many generations, and only the Pwerle or Kemarre owners can paint them. \n Betty is a hard working artist, whose works are very popular and have wide appeal. \n The paintings are aerial views of women's ceremonies and depict the waterholes (often in sacred places) where they take place. Much of the work is taken up with pairs of striped breasts moving forward as the woman dances, giving a great sense of movement to the work. Occasionally there will be patterns of the seeds and the bush plums the women eat at the ceremony. \n With such an interesting design, and Betty's sense of movement and colour, the paintings have a sense of greeting, and have a very uplifting effect in any area where they hang. It is this, and the very contemporary design which make her works so popular. At this stage, her works are still very affordable."
  }
]
